### DataFrame에서 행/열 삭제

In [1]:
# 모듈로딩
import pandas as pd

In [3]:
# 데이터 준비
data = {"name":["홍길동", "마징가", "원더우먼"],
        'job' : ["의적", "로봇", "영웅"],
        'gender' : ["남", "남", "여"],
        "age" : [100, 200, 300],
        "height" : [180, 300, 200]}

In [4]:
# DF로 데이터 저장
dataDF = pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

- [실습] 행 삭제 : 변수명.drop() 메서드 사용
    - 변수명.drop(labels, axis=0) : axis의 설정값에 따라 행 또는 열 삭제 진행
    - 변수명.drop(index) : 지정된 인덱스의 행 삭제

In [5]:
# 1개 행 삭제 -> 기본 값: 행 삭제, 원본 변경X
dataDF.drop(1) # 축을 지정 안하면 디폴트 값으로 전체 삭제 ==> 원본은 변경 X

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우먼  영웅      여  300     200

In [6]:
dataDF # 위에서 1번 행을 지웠지만 원본에는 변화 x

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우먼  영웅      여  300     200

In [7]:
## 2행 삭제 -> 기본 값: 행 삭제, 원본 변경X
dataDF.drop([0, 2])

  name job gender  age  height
1  마징가  로봇      남  200     300

- [실습] 열/칼럼 삭제 : 변수명. drop(axis = 1 or axis = "columns) 메서드
    - 삭제 방향 즉, 기준을 열로 설정 필수
    - 변수명.drop(labels, axis=1 or "columns") : axis의 설정값에 따라 행 또는 열 삭제 진행
    - 변수명.drop(columns) : 지정된 인덱스의 열 삭제

In [9]:
## age 칼럼을 삭제 
dataDF.drop("age", axis = 1) # 원본은 삭제 X

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [11]:
dataDF.drop("age", axis = "columns") # 원본은 삭제 X

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우먼  영웅      여     200

In [39]:
## gender, height 칼럼 삭제
dataDF.drop(columns = dataDF.columns[2:], axis = 1) # () 안에서 columns라고 지정하면 굳이 axis 값을 안 줘도 됨

   name job
0   홍길동  의적
1   마징가  로봇
2  원더우먼  영웅

In [36]:
dataDF.drop(["gender", "height"], axis = 1)

   name job  age
0   홍길동  의적  100
1   마징가  로봇  200
2  원더우먼  영웅  300